<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>课程内容</title>
    <link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.8.2/css/all.css"/>
    <link rel="stylesheet" href="${pageContext.request.contextPath}/css/all.css"/>
</head>
<body>
<p>
    项目负责人韩万江2003开始一直致力于软件工程和软件项目管理领域的研究和开发，探讨如何高效，实用的教学方式和方法，为此提出系列案例式教学模式，包括软件工程的三个方面：软件开发、软件项目管理和软件过程改进。为此与出版社有计划的出版系列案例教材：软件项目管理案例教程、软件工程案例教程和软件过程改进案例教程，其中前2个已经出版，并得到各高校很多教师的好评。不少的高校老师采用他们作为教材，尤其《软件项目管理教程》这个教材已经出版2年多，每天差不多都会收到老师的邮件，回答他们关于《软件项目管理案例教程》的问题。</p>
<p>主要成果如下：</p>
<p>出版教材如下： </p>
<p>&emsp;&emsp;2004年1月出版教材《软件开发项目管理》机械工业出版社</p>
<p>&emsp;&emsp;2005年1月出版教材《软件项目管理案例教程》机械工业出版社</p>
<p>&emsp;&emsp;2006年5月出版翻译教材《实用IT项目管理》机械工业出版社</p>
<p>&emsp;&emsp;2007年2月出版教材《软件工程案例教程》机械工业出版社</p>
<p>在《计算机应用研究》的核心期刊上发表文章如下： </p>
<p>&emsp;&emsp;2005年7月《过程管理在软件项目管理中的作用》</p>
<p>&emsp;&emsp;2007年7月《软件项目管理的实质》</p>
<p>在《计算机世界》发表如下文章： </p>
<p>&emsp;&emsp;2005年8月《如何实施软件项目的过程管理》</p>
<p>&emsp;&emsp;2006年3月《软件的工程化管理》</p>
<p>&emsp;&emsp;2006年4月《软件项目管理的实质》</p>
<p>&emsp;&emsp;2007年1月《IPv6将取代IPv4》</p>
<p>&emsp;&emsp;2007年4月《软件工程的三线索》</p>
<p>&emsp;&emsp;2007年4月《软件的开发过程》</p>
<p>&emsp;&emsp;2007年4月《软件开发工艺的改进》</p>
<p>&emsp;&emsp;2007年4月《软件生产线的管理》</p>
</body>
</html>
